jmeter/04_stress_overload_graceful_degradation_mixed_1200_tst.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="[STRESS OVERLOAD] Mixed 1200 RPS - Sustained Overload Graceful Degradation" enabled="true">
      <stringProp name="TestPlan.comments">Stress scenario above R_sat (1100). Ramp 0-&gt;600, baseline 600, ramp to 1200, hold 1200 RPS for 360s then reduce to 600 RPS for recovery. No extra chaos.</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="GATEWAY_HOST" elementType="Argument">
            <stringProp name="Argument.name">GATEWAY_HOST</stringProp>
            <stringProp name="Argument.value">172.30.35.37</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="GATEWAY_PORT" elementType="Argument">
            <stringProp name="Argument.name">GATEWAY_PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TARGET_PATH" elementType="Argument">
            <stringProp name="Argument.name">TARGET_PATH</stringProp>
            <stringProp name="Argument.value">/api/simulate-mixed-call</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="CHAOS_TARGET_PORT" elementType="Argument">
            <stringProp name="Argument.name">CHAOS_TARGET_PORT</stringProp>
            <stringProp name="Argument.value">8083</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="[Setup] Reset system state" enabled="true">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="[Setup] Clear runtime label properties" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">props.remove(&apos;official.benchmark.start.ms&apos;)
props.remove(&apos;official.benchmark.current.label&apos;)</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Setup] Reset chaos on backend 8081" enabled="true">
          <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">8081</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49015874">2\d\d</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">1</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Setup] Reset chaos on backend 8082" enabled="true">
          <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">8082</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49015874">2\d\d</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">1</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Setup] Reset chaos on backend 8083" enabled="true">
          <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">8083</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49015874">2\d\d</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">1</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Setup] Reset ALB Gateway state" enabled="true">
          <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/actuator/alb/reset</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49015874">2\d\d</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">1</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <TestAction guiclass="TestActionGui" testclass="TestAction" testname="[Setup] Wait 15000ms for Eureka/ALB/metrics to stabilize" enabled="true">
          <intProp name="ActionProcessor.action">1</intProp>
          <intProp name="ActionProcessor.target">0</intProp>
          <stringProp name="ActionProcessor.duration">15000</stringProp>
        </TestAction>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="[Main] Stress Overload - 1200 RPS sustained no chaos" enabled="true">
        <intProp name="ThreadGroup.num_threads">3500</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <longProp name="ThreadGroup.duration">810</longProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">30000</intProp>
          <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="[Label] Set benchmark phase label by elapsed time">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">long now = System.currentTimeMillis()
String startKey = &apos;official.benchmark.start.ms&apos;
if (props.get(startKey) == null) {
    props.put(startKey, String.valueOf(now))
}
long startMs = Long.parseLong(String.valueOf(props.get(startKey)))
long elapsedSec = (long) ((now - startMs) / 1000L)
def windows = [
  [0L, 60L, &apos;DISCARD_RAMP_0000_TO_0600_RPS&apos;],
  [60L, 180L, &apos;MEASURE_BASELINE_0600_RPS_HOLD_120S&apos;],
  [180L, 240L, &apos;DISCARD_RAMP_0600_TO_1200_RPS&apos;],
  [240L, 600L, &apos;MEASURE_STRESS_1200_RPS_HOLD_360S&apos;],
  [600L, 660L, &apos;DISCARD_RECOVERY_RAMP_1200_TO_0600_RPS&apos;],
  [660L, 780L, &apos;MEASURE_STRESS_RECOVERY_0600_RPS_HOLD_120S&apos;],
  [780L, 810L, &apos;DISCARD_RAMPDOWN_0600_TO_0000_RPS&apos;],
]
String label = &apos;DISCARD_OUTSIDE_DEFINED_WINDOWS&apos;
for (def w : windows) {
    if (elapsedSec &gt;= (long) w[0] &amp;&amp; elapsedSec &lt; (long) w[1]) {
        label = (String) w[2]
        break
    }
}
vars.put(&apos;BENCHMARK_LABEL&apos;, label)
props.put(&apos;official.benchmark.current.label&apos;, label)
vars.put(&apos;ELAPSED_SECONDS&apos;, String.valueOf(elapsedSec))</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <SwitchController guiclass="SwitchControllerGui" testclass="SwitchController" testname="Weighted mixed API profile switch | light 60%, medium 25%, slow 12%, very-slow 3%">
          <stringProp name="SwitchController.value">${__groovy(int r = java.util.concurrent.ThreadLocalRandom.current().nextInt(100); r &lt; 60 ? &apos;0&apos; : r &lt; 85 ? &apos;1&apos; : r &lt; 97 ? &apos;2&apos; : &apos;3&apos;)}</stringProp>
        </SwitchController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET ${TARGET_PATH}?profile=light" enabled="true">
            <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
            <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">${TARGET_PATH}?profile=light</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx response from mixed endpoint" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49015874">2\d\d</stringProp>
              </collectionProp>
              <intProp name="Assertion.test_type">1</intProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
            </ResponseAssertion>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="[Label] Rewrite sample label to benchmark phase" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">def label = vars.get(&apos;BENCHMARK_LABEL&apos;) ?: &apos;DISCARD_UNKNOWN&apos;
def path = vars.get(&apos;TARGET_PATH&apos;) ?: &apos;/api/simulate-mixed-call&apos;
prev.setSampleLabel(label + &apos;__GET_&apos; + path)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PostProcessor>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET ${TARGET_PATH}?profile=medium" enabled="true">
            <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
            <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">${TARGET_PATH}?profile=medium</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx response from mixed endpoint" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49015874">2\d\d</stringProp>
              </collectionProp>
              <intProp name="Assertion.test_type">1</intProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
            </ResponseAssertion>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="[Label] Rewrite sample label to benchmark phase" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">def label = vars.get(&apos;BENCHMARK_LABEL&apos;) ?: &apos;DISCARD_UNKNOWN&apos;
def path = vars.get(&apos;TARGET_PATH&apos;) ?: &apos;/api/simulate-mixed-call&apos;
prev.setSampleLabel(label + &apos;__GET_&apos; + path)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PostProcessor>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET ${TARGET_PATH}?profile=slow" enabled="true">
            <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
            <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">${TARGET_PATH}?profile=slow</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx response from mixed endpoint" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49015874">2\d\d</stringProp>
              </collectionProp>
              <intProp name="Assertion.test_type">1</intProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
            </ResponseAssertion>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="[Label] Rewrite sample label to benchmark phase" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">def label = vars.get(&apos;BENCHMARK_LABEL&apos;) ?: &apos;DISCARD_UNKNOWN&apos;
def path = vars.get(&apos;TARGET_PATH&apos;) ?: &apos;/api/simulate-mixed-call&apos;
prev.setSampleLabel(label + &apos;__GET_&apos; + path)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PostProcessor>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET ${TARGET_PATH}?profile=very-slow" enabled="true">
            <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
            <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">${TARGET_PATH}?profile=very-slow</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx response from mixed endpoint" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49015874">2\d\d</stringProp>
              </collectionProp>
              <intProp name="Assertion.test_type">1</intProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
            </ResponseAssertion>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="[Label] Rewrite sample label to benchmark phase" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">def label = vars.get(&apos;BENCHMARK_LABEL&apos;) ?: &apos;DISCARD_UNKNOWN&apos;
def path = vars.get(&apos;TARGET_PATH&apos;) ?: &apos;/api/simulate-mixed-call&apos;
prev.setSampleLabel(label + &apos;__GET_&apos; + path)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer | Stress overload 1200 RPS">
          <collectionProp name="load_profile">
            <collectionProp name="-1878747406">
              <stringProp name="start_rps_0">0</stringProp>
              <stringProp name="end_rps_0">600</stringProp>
              <stringProp name="duration_sec_0">60</stringProp>
            </collectionProp>
            <collectionProp name="-1827363598">
              <stringProp name="start_rps_1">600</stringProp>
              <stringProp name="end_rps_1">600</stringProp>
              <stringProp name="duration_sec_1">120</stringProp>
            </collectionProp>
            <collectionProp name="-1782210666">
              <stringProp name="start_rps_2">600</stringProp>
              <stringProp name="end_rps_2">1200</stringProp>
              <stringProp name="duration_sec_2">60</stringProp>
            </collectionProp>
            <collectionProp name="-382064381">
              <stringProp name="start_rps_3">1200</stringProp>
              <stringProp name="end_rps_3">1200</stringProp>
              <stringProp name="duration_sec_3">360</stringProp>
            </collectionProp>
            <collectionProp name="-427242504">
              <stringProp name="start_rps_4">1200</stringProp>
              <stringProp name="end_rps_4">600</stringProp>
              <stringProp name="duration_sec_4">60</stringProp>
            </collectionProp>
            <collectionProp name="-1827216634">
              <stringProp name="start_rps_5">600</stringProp>
              <stringProp name="end_rps_5">600</stringProp>
              <stringProp name="duration_sec_5">120</stringProp>
            </collectionProp>
            <collectionProp name="-1828881793">
              <stringProp name="start_rps_6">600</stringProp>
              <stringProp name="end_rps_6">0</stringProp>
              <stringProp name="duration_sec_6">30</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="[Teardown] Reset all chaos and ALB state">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </PostThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Teardown] Reset chaos on backend 8081" enabled="true">
          <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">8081</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49015874">2\d\d</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">1</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Teardown] Reset chaos on backend 8082" enabled="true">
          <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">8082</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49015874">2\d\d</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">1</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Teardown] Reset chaos on backend 8083" enabled="true">
          <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">8083</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/chaos/reset</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49015874">2\d\d</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">1</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="[Teardown] Reset ALB Gateway state" enabled="true">
          <stringProp name="HTTPSampler.domain">${GATEWAY_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${GATEWAY_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/actuator/alb/reset</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 2xx" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49015874">2\d\d</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">1</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>